<a href="https://colab.research.google.com/github/yooste/SOLUX_summer_data/blob/master/2%EC%A3%BC%EC%B0%A8/pandas_chap09_0730.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

In [1]:
import pandas as pd

## **How to remove duplicate row in dataframe**

In [2]:
student_list = [{'name':'John','major':'Computer Science','sex':'male'},
                {'name':'Nate','major':'Computer Science','sex':'male'},
                {'name':'Edward','major':'Computer Science','sex':'male'},
                {'name':'Zara','major':'Psychology','sex':'female'},
                {'name':'John','major':'Computer Science','sex':'male'},
              ]
df = pd.DataFrame(student_list, columns = ['name','major','sex'])
df

     name             major     sex
0    John  Computer Science    male
1    Nate  Computer Science    male
2  Edward  Computer Science    male
3    Zara        Psychology  female
4    John  Computer Science    male

In [3]:
df. duplicated()    # duplicated(): 중복된 데이터를 보여줌
# True는 중복을 의미함

0    False
1    False
2    False
3    False
4     True
dtype: bool

In [4]:
df.drop_duplicates()    # 중복된 행 삭제

     name             major     sex
0    John  Computer Science    male
1    Nate  Computer Science    male
2  Edward  Computer Science    male
3    Zara        Psychology  female

## **How to remove duplicate by column value**

In [5]:
student_list = [{'name':'John','major':'Computer Science','sex':'male'},
                {'name':'Nate','major':'Computer Science','sex':'male'},
                {'name':'Edward','major':'Computer Science','sex':'male'},
                {'name':'Zara','major':'Psychology','sex':'female'},
                {'name':'Wendy','major':'Economics','sex':'female'},
                {'name':'Nate','major':None,'sex':'male'},
                {'name':'John','major':'Economics','sex':'male'}]
df = pd.DataFrame(student_list, columns = ['name','major','sex'])
df

     name             major     sex
0    John  Computer Science    male
1    Nate  Computer Science    male
2  Edward  Computer Science    male
3    Zara        Psychology  female
4   Wendy         Economics  female
5    Nate              None    male
6    John         Economics    male

In [6]:
df.duplicated()   # 완벽히 일치하는 행이 없기 때문에 True 값이 없음

0    False
1    False
2    False
3    False
4    False
5    False
6    False
dtype: bool

In [7]:
df.duplicated(['name']) # 이름이 같으면 중복되었다고 판단할 경우

0    False
1    False
2    False
3    False
4    False
5     True
6     True
dtype: bool

In [9]:
df.drop_duplicates(['name'], keep = 'first')    # 이름이 같으면 첫번째 인자는 남기고 중복된 행을 삭제
# keep 값을 안 줄 경우 default로 first가 들어가 첫번째는 남기고 삭제

     name             major     sex
0    John  Computer Science    male
1    Nate  Computer Science    male
2  Edward  Computer Science    male
3    Zara        Psychology  female
4   Wendy         Economics  female

In [10]:
df.drop_duplicates(['name'], keep='last') # 마지막 인자를 남기고 중복된 행 삭제

     name             major     sex
2  Edward  Computer Science    male
3    Zara        Psychology  female
4   Wendy         Economics  female
5    Nate              None    male
6    John         Economics    male